studenti/master_teme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-15 Fri 10:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Teme za master radove</title>
<meta name="author" content="Igor Dejanović" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../orgcss/org.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Teme za master radove</h1>

<div id="outline-container-orga2c6bcc" class="outline-2">
<h2 id="orga2c6bcc">Obasti</h2>
<div class="outline-text-2" id="text-orga2c6bcc">
<p>
Master teme su iz oblasti inženjerstva jezika (<i>Language Engineering</i>) što
uključuje:
</p>
<ul class="org-ul">
<li>Dizajn i implementacija programskih jezika i jezika specifičnih za domen</li>
<li>Parseri</li>
<li>Prevodioci</li>
<li>Generisanje koda</li>
<li>Interpretacija</li>
<li><i>Literate programming</i></li>
<li>Programski editori</li>
<li>Vizualizacija programa i njihovog izvršavanja</li>
<li>Debagovanje</li>
<li>Analiza <i>legacy</i> sistema</li>
<li>Optimizacije koda</li>
<li>Otkrivanje kopija</li>
<li>Refaktorisanje</li>
<li>&#x2026;</li>
</ul>

<p>
Videti materijale sa predmeta <a href="http://www.igordejanovic.net/courses/jsd.html"><i>Jezici specifični za domen</i></a>
</p>

<p>
Takođe je moguće dobiti temu i iz oblasti <a href="http://www.igordejanovic.net/courses/uks.html">upravljanja konfiguracijom softvera</a>
(<i>Software Configuration Management</i>):
</p>
<ul class="org-ul">
<li>git</li>
<li>docker</li>
<li>kubernetes</li>
<li>Sistemi za Continuous Integration / Continuous Delivery</li>
</ul>
</div>
</div>

<div id="outline-container-org7f2bd92" class="outline-2">
<h2 id="org7f2bd92">Slobodne teme</h2>
<div class="outline-text-2" id="text-org7f2bd92">
</div>
<div id="outline-container-org451a3bb" class="outline-3">
<h3 id="org451a3bb">Podrška za AST-&gt;text transformacije (2 teme - <a href="https://github.com/textX/textX/">textX</a>, <a href="https://github.com/igordejanovic/parglare">parglare</a>)</h3>
<div class="outline-text-3" id="text-org451a3bb">
<ul class="org-ul">
<li>Videti <a href="https://github.com/textX/textX/issues/36">https://github.com/textX/textX/issues/36</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5fc215b" class="outline-3">
<h3 id="org5fc215b">Podrška za <i>indentation/column-based</i> jezike</h3>
<div class="outline-text-3" id="text-org5fc215b">
<ul class="org-ul">
<li>Videti <a href="https://github.com/textX/textX/issues/44">https://github.com/textX/textX/issues/44</a> i <a href="https://github.com/igordejanovic/parglare/issues/5">https://github.com/igordejanovic/parglare/issues/5</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3ea4eb4" class="outline-3">
<h3 id="org3ea4eb4">Podrška za bojenje koda i navigaciju za ugrađene (<i>embedded</i>) editore i jezike bazirane na <a href="https://github.com/textX/textX">textX</a> / <a href="https://github.com/igordejanovic/parglare">parglare</a> (2 teme - textX, parglare)</h3>
<div class="outline-text-3" id="text-org3ea4eb4">
<ul class="org-ul">
<li>Videti:
<ul class="org-ul">
<li><a href="https://qscintilla.com/">QScintilla</a></li>
<li><a href="https://wiki.qt.io/Qt_for_Python">Qt for Python - PySide</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4672a18" class="outline-3">
<h3 id="org4672a18">Podrška za IntelliSense u jezicima baziranim na <a href="https://github.com/igordejanovic/parglare">parglare</a> biblioteci u Visual Studio Code</h3>
<div class="outline-text-3" id="text-org4672a18">
<ul class="org-ul">
<li>Videti <a href="https://github.com/textX/textX-LS">textX-LS</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2ff6e71" class="outline-3">
<h3 id="org2ff6e71">Podrška za strukturu i bojenje koda u jezicima baziranim na <a href="https://github.com/igordejanovic/parglare">parglare</a> biblioteci u Visual Studio Code</h3>
<div class="outline-text-3" id="text-org2ff6e71">
<ul class="org-ul">
<li>Videti:
<ul class="org-ul">
<li><a href="https://github.com/textX/textX-LS">textX-LS</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org414faf6" class="outline-3">
<h3 id="org414faf6">Podrška za vizualizaciju jezika baziranih na <a href="https://github.com/igordejanovic/parglare">parglare</a> biblioteci.</h3>
<div class="outline-text-3" id="text-org414faf6">
<ul class="org-ul">
<li>Videti <a href="https://github.com/textX/viewX-vscode">viewX-vscode</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org48bcd6f" class="outline-2">
<h2 id="org48bcd6f">Teme u izradi</h2>
<div class="outline-text-2" id="text-org48bcd6f">
</div>
<div id="outline-container-orga4f8fdf" class="outline-3">
<h3 id="orga4f8fdf">Boris Šuličenko: Veb bazirani debager za <a href="https://github.com/igordejanovic/parglare">Parglare parser</a></h3>
<div class="outline-text-3" id="text-orga4f8fdf">
<ul class="org-ul">
<li>Tema izdata: septembar 2021.</li>
</ul>

<blockquote>
<p>
Prikaz tekućeg stanja parsera (GSS strukture) i parcijalnih stabala. Korak po
korak izvršavanje. Osmisliti protokol komunikacije sa instancom parsera.
Upotreba WebSocket-a i asinhronog programiranja u Python-u. Vizualizacija u
Web browser-u upotrebom d3js ili druge JavaScript biblioteke.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgb4a49f6" class="outline-3">
<h3 id="orgb4a49f6">Dejan Šorgić: Podrška za <a href="https://www.youtube.com/watch?v=tSFdYYnQmjA">pyFlies DSL</a> u Visual Studio Code</h3>
<div class="outline-text-3" id="text-orgb4a49f6">
<ul class="org-ul">
<li>Tema izdata: jun 2021.</li>
<li>Videti <a href="https://github.com/textX/textX">textX</a> i <a href="https://github.com/textX/textX-LS">textX-LS</a></li>
<li><a href="https://microsoft.github.io/language-server-protocol/">https://microsoft.github.io/language-server-protocol/</a></li>
<li><p>
<a href="https://www.youtube.com/watch?v=tSFdYYnQmjA">https://www.youtube.com/watch?v=tSFdYYnQmjA</a>
</p>

<blockquote>
<p>
pyFlies je jezik za definisanje eksperimenata u oblasti psihologije i neuro
nauka. LSP bi omogućio &ldquo;pametnu&rdquo; dopunu koda i navigaciju. Instalirao bi se
zajedno sa <a href="https://code.visualstudio.com/">VS Code</a> ekstenzijom i omogućio bolje korisničko iskustvo u upotrebi
jezika. Implementacija bi bila bazirana na <a href="https://github.com/textX/textX-LS">textX-LS</a> i <a href="https://github.com/openlawlibrary/pygls">pygls</a>.
</p>
</blockquote></li>
</ul>
</div>
</div>
<div id="outline-container-org9f77613" class="outline-3">
<h3 id="org9f77613">Milica Travica: Vizuelizacija i navigacija nad istorijom ličnih promena nad projektom</h3>
<div class="outline-text-3" id="text-org9f77613">
<ul class="org-ul">
<li>Tema izdata: jun 2021.</li>
<li><a href="https://github.com/MicaTravica/CodeRibbon">https://github.com/MicaTravica/CodeRibbon</a></li>
<li>Videti <a href="https://github.com/utk-se/CodeRibbon/">CodeRibbon</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf82833c" class="outline-3">
<h3 id="orgf82833c">Aleksa Ivković: Platforma za specifikaciju i interpretaciju interaktivne fikcije</h3>
<div class="outline-text-3" id="text-orgf82833c">
<ul class="org-ul">
<li>Tema izdata: jun 2021.</li>
<li><a href="https://github.com/AleksaIvkovic/WhatIf">https://github.com/AleksaIvkovic/WhatIf</a></li>
<li><a href="https://github.com/tajmone/awesome-interactive-fiction">A curated list of interactive fiction frameworks, tools, and resources</a></li>
</ul>

<blockquote>
<p>
Istražiti postojeće jezike i editore za opis IF igara. Osmisliti i
implementirati jezik za modelovanje IF igara upotrebom <a href="https://github.com/textX/textX/">textX</a> ili <a href="https://github.com/igordejanovic/parglare">parglare</a>.
Implementirati interpreter modela. Kao studiju slučaja implementirati
proizvoljnu igru.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org25f106c" class="outline-3">
<h3 id="org25f106c">Nenad Mišić: automatsko raspoređivanje elemenata dijagrama uporebom Sugiyama algoritma, LSTM neuronskih mreža i Eclipse Layout Kernel biblioteke</h3>
<div class="outline-text-3" id="text-org25f106c">
<ul class="org-ul">
<li>Tema izdata: april 2021.</li>
</ul>
</div>
</div>

<div id="outline-container-org4dc09d2" class="outline-3">
<h3 id="org4dc09d2">Aleksandar Vujasinović: mikroservisi za domen finansija i trgovine na berzi</h3>
<div class="outline-text-3" id="text-org4dc09d2">
<ul class="org-ul">
<li>Tema izdata: februar 2021.</li>
</ul>
</div>
</div>

<div id="outline-container-orgba88f44" class="outline-3">
<h3 id="orgba88f44">Radoš Aćimović: Sistemi za upravljanje softverskim kontejnerima</h3>
<div class="outline-text-3" id="text-orgba88f44">
<ul class="org-ul">
<li>Tema izdata: januar 2021.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcb16535" class="outline-3">
<h3 id="orgcb16535">Andrej Jokić: Transformacije AST -&gt; tekst (<i>pretty printing</i>)</h3>
<div class="outline-text-3" id="text-orgcb16535">
<ul class="org-ul">
<li>Tema izdata: septembar 2020.</li>
<li><a href="https://github.com/ajokic1/pprint-textx">https://github.com/ajokic1/pprint-textx</a></li>
</ul>
</div>
</div>

<div id="outline-container-org97ed0e2" class="outline-3">
<h3 id="org97ed0e2">Milan Šović: Minimalna jezička infastruktura za bojenje koda, sklapanje (<i>folding</i>) i <i>Intellisense</i> za jezike bazirane na <a href="https://github.com/textX/textX">textX</a>-u</h3>
<div class="outline-text-3" id="text-org97ed0e2">
<ul class="org-ul">
<li><p>
Tema izdata: oktobar 2018.
</p>
<blockquote>
<p>
Na osnovu textX gramatike, i dodatnih DSL-ova po potrebi, generisati minimalni
web bazirani editor sa bojenjem koda, sklapanjem i komunikacijom sa <a href="https://github.com/textX/textX-LS">Language
Server Protocol serverom</a> (podrškom za IntelliSense). Editor treba da ima
minimalne zavisnosti tako da se može korisiti u različitim kontekstima (na
web-u, kao ugrađeni, kao deo desktop aplikacija, kao test editor pri razvoju
gramatike i sl.)
</p>
</blockquote></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9f664b4" class="outline-2">
<h2 id="org9f664b4">Završene teme</h2>
<div class="outline-text-2" id="text-org9f664b4">
</div>
<div id="outline-container-org7df2e30" class="outline-3">
<h3 id="org7df2e30">Dragutin Marjanović: Upotreba <a href="https://github.com/zio/zio-telemetry">zio-telemetry</a> za prikupljanje i analizu tragova u distribuiranim sistemima baziranim na mikroservisnim arhitekturama.</h3>
<div class="outline-text-3" id="text-org7df2e30">
<ul class="org-ul">
<li>Tema izdata: decembar 2019.</li>
<li>Odbranjeno: jun 2020.</li>
<li><a href="https://github.com/zio/zio-telemetry">https://github.com/zio/zio-telemetry</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7b05084" class="outline-3">
<h3 id="org7b05084">Stefan Ristanović: Jezik i interpreter za integraciju i automatizaciju REST baziranih aplikacija</h3>
<div class="outline-text-3" id="text-org7b05084">
<ul class="org-ul">
<li>Tema izdata: april 2019.</li>
<li>Odbranjeno: mart 2020.</li>
<li><a href="https://github.com/stkeky/calcifer">https://github.com/stkeky/calcifer</a></li>
<li><a href="https://github.com/stkeky/calcifer-ux">https://github.com/stkeky/calcifer-ux</a></li>
</ul>

<blockquote>
<p>
Kreirati DSL (tekstualni i opciono grafički) za definisanje REST baziranih
procesa i integraciju automatizaciju REST servisa. Implementaciju uraditi uz
oslonac na <a href="https://github.com/textX/textX">textX</a> i <a href="https://code.visualstudio.com/">VS Code</a>. Primer: <a href="https://zapier.com/">Zapier</a>.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org4ba1ec0" class="outline-3">
<h3 id="org4ba1ec0">Milorad Vojnović: DSL za generisanje API testova za GraphQL upite</h3>
<div class="outline-text-3" id="text-org4ba1ec0">
<ul class="org-ul">
<li>Tema izdata: avgust 2018.</li>
<li>Odbranjeno: septembar 2019.</li>
<li><a href="https://github.com/miloradvojnovic/TestQL">https://github.com/miloradvojnovic/TestQL</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge7598b3" class="outline-3">
<h3 id="orge7598b3">Željko Bal: Jezik za opis i automatsko generisanje CLI i GUI interfejsa</h3>
<div class="outline-text-3" id="text-orge7598b3">
<ul class="org-ul">
<li>mart 2019.</li>
<li><a href="https://github.com/zeljko-bal/CID">https://github.com/zeljko-bal/CID</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3152d97" class="outline-3">
<h3 id="org3152d97">Filip Frank: Jezik za podršku ekstrakciji podataka iz nestrukturiranih izvora podataka sa veba</h3>
<div class="outline-text-3" id="text-org3152d97">
<ul class="org-ul">
<li>oktobar 2018.</li>
<li><a href="https://github.com/Pazzo92/scraping-dsl">https://github.com/Pazzo92/scraping-dsl</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5756dc0" class="outline-3">
<h3 id="org5756dc0">Daniel Elero: Server i ekstenzija za VS Code okruženje za podršku jezicima baziranim na textX alatu\</h3>
<div class="outline-text-3" id="text-org5756dc0">
<ul class="org-ul">
<li>septembar 2018.</li>
<li><a href="https://github.com/textX-tools/textX-languageserver">https://github.com/textX-tools/textX-languageserver</a></li>
<li><a href="https://github.com/textX-tools/textX-vscode">https://github.com/textX-tools/textX-vscode</a></li>
</ul>
</div>
</div>

<div id="outline-container-org924065a" class="outline-3">
<h3 id="org924065a">Daniel Kupčo: Podrška vizualizaciji jezika kreiranih upotrebom textX biblioteke u okviru Visual Studio Code editora</h3>
<div class="outline-text-3" id="text-org924065a">
<ul class="org-ul">
<li>septembar 2018.</li>
<li><a href="https://github.com/textX-tools/viewX-vscode">https://github.com/textX-tools/viewX-vscode</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf36bcd2" class="outline-3">
<h3 id="orgf36bcd2">Nemanja Starčev: Podrška vizualizaciji strukture i bojenju koda u Visual Studio Code editoru za jezike bazirane na textX alatu</h3>
<div class="outline-text-3" id="text-orgf36bcd2">
<ul class="org-ul">
<li>jun 2018.</li>
<li><a href="https://github.com/textX-tools/textX-extensions">https://github.com/textX-tools/textX-extensions</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Igor Dejanović</p>
<p class="date">Created: 2021-10-15 Fri 10:41</p>
</div>
</body>
</html>
